{
  "metadata": {
    "organizacion": "XM-Mercado",
    "proyecto": "ModeloDatosComun",
    "sprint": "ModeloDatosComun\\MDC - PARÁMETROS\\Año 2020\\Release 2\\Sprint 14",
    "max_historias_evaluadas": 5,
    "dias_sprint_config": 10
  },
  "data": [
    {
      "id": 25884,
      "titulo": "FUNC - 25884 - Consultar Versión de Líneas",
      "evaluacion_invest": {
        "Independiente": {
          "puntaje": 3,
          "justificacion": "La historia depende de las HU #25893 y #25889 para la presentación de la UI, lo que limita su autonomía. La lógica de consulta es independiente, pero la visualización no."
        },
        "Negociable": {
          "puntaje": 2,
          "justificacion": "Los criterios de aceptación son muy prescriptivos y detallan la implementación técnica (nombres de campos, reutilización de métodos), dejando poco espacio para la negociación."
        },
        "Valiosa": {
          "puntaje": 4,
          "justificacion": "Aporta valor al permitir a los usuarios rastrear el historial de cambios de un elemento, lo cual es crucial para la auditoría y el análisis de datos históricos."
        },
        "Estimable": {
          "puntaje": 3,
          "justificacion": "La estimación es incierta debido a la dependencia en la implementación de las interfaces de otras historias. El esfuerzo para integrar y adaptar esos componentes es difícil de predecir."
        },
        "Pequeña": {
          "puntaje": 3,
          "justificacion": "El alcance es moderado. Involucra una consulta compleja, lógica de negocio para la autorización de atributos y la presentación de datos en modo de solo lectura."
        },
        "Testeable": {
          "puntaje": 5,
          "justificacion": "Los criterios de aceptación son claros, específicos y detallan los datos de entrada, el proceso y el resultado esperado, lo que facilita la creación de casos de prueba."
        }
      },
      "complejidad": 3.5,
      "posibles_mejoras": [
        "Desacoplar la UI de las historias de modificación. Definir un componente de 'vista de solo lectura' genérico que pueda ser reutilizado.",
        "La descripción 'Como Roles asignados' es muy genérica. Especificar los roles concretos (ej. 'Como Auditor') para clarificar el propósito.",
        "Referenciar explícitamente la HU que define las 'reglas de autorización de Atributos' para mejorar la claridad y estimabilidad."
      ],
      "estimacion_dias": 7.3,
      "url": "https://dev.azure.com/XM-Mercado/b98d1df5-c2a4-4241-8000-c179906fa7b7/_workitems/edit/25884"
    },
    {
      "id": 25885,
      "titulo": "FUNC- 25885 - . Administrar Líneas (Datos XM)",
      "evaluacion_invest": {
        "Independiente": {
          "puntaje": 2,
          "justificacion": "Tiene dependencias fuertes con otras historias (#25893, #25901, #9223) para sus acciones principales (Editar, Eliminar) y reglas de consulta, lo que impide su desarrollo y entrega autónoma."
        },
        "Negociable": {
          "puntaje": 3,
          "justificacion": "Aunque los campos y filtros están definidos, hay espacio para negociar la experiencia de usuario en la gestión de columnas y la interacción general con la tabla."
        },
        "Valiosa": {
          "puntaje": 5,
          "justificacion": "Proporciona un punto de acceso centralizado para que los roles autorizados gestionen los datos XM de las líneas, lo cual es una funcionalidad fundamental del sistema."
        },
        "Estimable": {
          "puntaje": 2,
          "justificacion": "La estimación es difícil y de alto riesgo debido a las dependencias. El esfuerzo total depende del estado y la complejidad de las otras historias."
        },
        "Pequeña": {
          "puntaje": 3,
          "justificacion": "El alcance es de tamaño medio. Aunque es una sola pantalla, incluye filtros, una tabla con columnas dinámicas y la integración de acciones externas."
        },
        "Testeable": {
          "puntaje": 5,
          "justificacion": "Los criterios de aceptación son muy claros. Se pueden probar los filtros, la visualización de columnas y la correcta invocación de las acciones de editar/eliminar."
        }
      },
      "complejidad": 3,
      "posibles_mejoras": [
        "Dividir la historia: una para 'Consultar y filtrar Líneas (Datos XM)' y otras para integrar las acciones de 'Editar' y 'Eliminar' cuando sus dependencias estén listas.",
        "Resumir o citar las 'Reglas Resultado de la Consulta de la HU #9223' directamente en la descripción para evitar la necesidad de consultar otra HU.",
        "Definir el comportamiento esperado si las HU dependientes no están implementadas (ej. ocultar o deshabilitar los botones de acción)."
      ],
      "estimacion_dias": 6.3,
      "url": "https://dev.azure.com/XM-Mercado/b98d1df5-c2a4-4241-8000-c179906fa7b7/_workitems/edit/25885"
    },
    {
      "id": 25886,
      "titulo": "FUNC- 25886. Administrar Líneas (Datos CIM)",
      "evaluacion_invest": {
        "Independiente": {
          "puntaje": 2,
          "justificacion": "Al igual que la HU 25885, tiene dependencias directas con #25889 (Editar), #25901 (Eliminar) y #9223 (Reglas), lo que la hace no independiente."
        },
        "Negociable": {
          "puntaje": 3,
          "justificacion": "El qué (campos, filtros) está bien definido, pero el cómo (interfaz de gestión de columnas, interacciones) es negociable."
        },
        "Valiosa": {
          "puntaje": 5,
          "justificacion": "Es una funcionalidad clave que permite a los usuarios administrar los datos CIM de las líneas, necesaria para la operación del sistema."
        },
        "Estimable": {
          "puntaje": 2,
          "justificacion": "La estimación es arriesgada por las mismas razones que la HU 25885: las dependencias externas hacen que el esfuerzo real sea incierto."
        },
        "Pequeña": {
          "puntaje": 3,
          "justificacion": "Es una historia de tamaño medio, similar en esfuerzo a la HU 25885."
        },
        "Testeable": {
          "puntaje": 5,
          "justificacion": "Los criterios de aceptación son específicos y permiten pruebas exhaustivas de los filtros, la tabla y las acciones."
        }
      },
      "complejidad": 3,
      "posibles_mejoras": [
        "Considerar la misma división que en la HU 25885: una historia para la consulta/filtrado y otras para la integración de acciones.",
        "Dado que esta HU y la 25885 son casi idénticas, se podría crear una épica 'Administrar Datos de Líneas' con HUs hijas para evitar duplicación en la gestión.",
        "Aclarar las reglas de la HU #9223 en la descripción."
      ],
      "estimacion_dias": 6.3,
      "url": "https://dev.azure.com/XM-Mercado/b98d1df5-c2a4-4241-8000-c179906fa7b7/_workitems/edit/25886"
    },
    {
      "id": 25889,
      "titulo": "FUNC-25889. Crear/Modificar Líneas(Datos CIM)",
      "evaluacion_invest": {
        "Independiente": {
          "puntaje": 3,
          "justificacion": "Tiene una dependencia de validación con la HU #25893 y una dependencia de acción con la HU #25902. La dependencia de validación entre dos formularios de edición diferentes es un acoplamiento no deseado."
        },
        "Negociable": {
          "puntaje": 2,
          "justificacion": "La historia es una especificación técnica detallada. Los atributos, tipos de datos, validaciones y unidades están definidos de forma rígida, dejando casi nulo espacio para la negociación."
        },
        "Valiosa": {
          "puntaje": 5,
          "justificacion": "El valor es muy alto, ya que mantener los datos CIM actualizados es fundamental para la integridad de los datos del sistema y los análisis de red."
        },
        "Estimable": {
          "puntaje": 4,
          "justificacion": "A pesar de la dependencia, el trabajo está claramente definido. La estimación es factible, aunque la complejidad de las validaciones debe ser analizada en detalle."
        },
        "Pequeña": {
          "puntaje": 2,
          "justificacion": "Es una historia grande. La implementación de un formulario con 14 campos y múltiples reglas de validación complejas y condicionales requiere un esfuerzo considerable."
        },
        "Testeable": {
          "puntaje": 5,
          "justificacion": "Los criterios de aceptación son extremadamente detallados, lo que permite crear un conjunto de pruebas unitarias y de integración muy completo para cada campo y regla."
        }
      },
      "complejidad": 4,
      "posibles_mejoras": [
        "Dividir la historia por grupos lógicos de atributos (ej. 'Atributos de Servicio', 'Parámetros de Secuencia Positiva', 'Parámetros de Secuencia Cero') para hacerla más manejable.",
        "Aclarar la estrategia para manejar la dependencia de validación con la HU #25893. ¿Qué sucede si el 'Tipo de línea' no está disponible?",
        "El botón 'Eliminar' debería ser parte de su propia historia (#25902) y no solo una acción mencionada aquí para mantener el enfoque de la HU en Crear/Modificar."
      ],
      "estimacion_dias": 8.3,
      "url": "https://dev.azure.com/XM-Mercado/b98d1df5-c2a4-4241-8000-c179906fa7b7/_workitems/edit/25889"
    },
    {
      "id": 25892,
      "titulo": "FUNC-25892. Administrar líneas (Datos Generales)",
      "evaluacion_invest": {
        "Independiente": {
          "puntaje": 1,
          "justificacion": "Es una historia 'orquestadora' con múltiples dependencias (#8589, y las HUs de Ver/Editar/Eliminar de cada tipo de elemento). No puede ser desarrollada de forma aislada."
        },
        "Negociable": {
          "puntaje": 3,
          "justificacion": "Aunque los filtros y columnas están definidos, el layout general y la interacción entre las múltiples secciones y acciones podrían ser negociados."
        },
        "Valiosa": {
          "puntaje": 4,
          "justificacion": "Proporciona un punto de entrada unificado para la gestión de elementos, lo cual es muy valioso. Sin embargo, la cláusula 'Para' está vacía, lo que es un defecto grave en la definición de la historia."
        },
        "Estimable": {
          "puntaje": 1,
          "justificacion": "No es estimable en su forma actual. El alcance es demasiado grande y las dependencias son muchas. Es una épica, no una historia."
        },
        "Pequeña": {
          "puntaje": 1,
          "justificacion": "Es una historia muy grande (una épica). Define una pantalla de gestión maestra con filtros complejos, resultados en pestañas, acciones dinámicas y lógica de permisos."
        },
        "Testeable": {
          "puntaje": 2,
          "justificacion": "Probar la historia en su totalidad es extremadamente complejo debido a la combinación de filtros, permisos, tipos de elementos y acciones. La falta de una cláusula 'Para' clara dificulta la definición del criterio de éxito final."
        }
      },
      "complejidad": 5,
      "posibles_mejoras": [
        "**Dividir esta épica en historias más pequeñas y manejables.**",
        "HU 1: Implementar el selector de 'Tipo de elemento' y el botón 'Nuevo'.",
        "HU 2: Implementar la sección de filtros de 'Datos Generales' y la lógica de consulta.",
        "HU 3: Implementar la tabla de resultados de 'Datos Generales' con paginación y columnas por defecto.",
        "HU 4: Implementar la funcionalidad de agregar/quitar columnas basada en permisos.",
        "HU 5: Integrar las acciones 'Ver/Editar' y 'Eliminar' para la tabla.",
        "**Completar la descripción de la historia. La cláusula 'Para' debe ser rellenada para articular el valor de negocio.**"
      ],
      "estimacion_dias": 10.3,
      "url": "https://dev.azure.com/XM-Mercado/b98d1df5-c2a4-4241-8000-c179906fa7b7/_workitems/edit/25892"
    }
  ]
}