{
  "metadata": {
    "organizacion": "XM-Mercado",
    "proyecto": "ModeloDatosComun",
    "sprint": "ModeloDatosComun\\MDC - PARÁMETROS\\Año 2020\\Release 2\\Sprint 14",
    "max_historias_evaluadas": 5,
    "dias_sprint_config": 10
  },
  "data": [
    {
      "id": 25884,
      "titulo": "FUNC - 25884 - Consultar Versión de Líneas",
      "evaluacion_invest": {
        "Independiente": {
          "puntaje": 2,
          "justificacion": "Depende de las HU de modificación (#25893, #25889) para la reutilización de la interfaz, lo que la hace no ser completamente independiente."
        },
        "Negociable": {
          "puntaje": 3,
          "justificacion": "El alcance es bastante específico en cuanto a la recuperación y presentación de datos, pero hay cierto margen en cómo se integra la UI, haciéndola parcialmente negociable."
        },
        "Valiosa": {
          "puntaje": 5,
          "justificacion": "El valor es claro y alto: permitir a los usuarios auditar y consultar el historial de cambios de un elemento crítico de la red."
        },
        "Estimable": {
          "puntaje": 4,
          "justificacion": "Los criterios de aceptación son detallados y especifican las tablas y campos, lo que facilita una estimación precisa del esfuerzo de backend y frontend."
        },
        "Pequeña": {
          "puntaje": 4,
          "justificacion": "La funcionalidad es de solo lectura y se enfoca en una sola tarea (consultar versión), lo que la hace relativamente pequeña y manejable."
        },
        "Testeable": {
          "puntaje": 5,
          "justificacion": "Los criterios de aceptación son muy claros y específicos sobre los datos a mostrar y el estado de la UI (botones deshabilitados), lo que la hace altamente testeable."
        }
      },
      "puntos_historia": 3,
      "dias_trabajo_aproximados": "2-3",
      "complejidad": 2.5,
      "posibles_mejoras": [
        "El rol de usuario 'Roles asignados' es demasiado genérico. Se debe especificar qué roles funcionales (p. ej., 'Operador de Red', 'Auditor de Datos') necesitan esta vista.",
        "Aclarar el orden de desarrollo con respecto a las HU #25893 y #25889 para evitar bloqueos o retrabajo en el componente de UI compartido."
      ],
      "estimacion_dias": 5.3,
      "url": "https://dev.azure.com/XM-Mercado/b98d1df5-c2a4-4241-8000-c179906fa7b7/_workitems/edit/25884"
    },
    {
      "id": 25885,
      "titulo": "FUNC- 25885 - . Administrar Líneas (Datos XM)",
      "evaluacion_invest": {
        "Independiente": {
          "puntaje": 1,
          "justificacion": "No es independiente. Las acciones principales (Ver/Editar, Eliminar) dependen directamente de la finalización de otras historias (#25893, #25901)."
        },
        "Negociable": {
          "puntaje": 3,
          "justificacion": "La funcionalidad de agregar/quitar columnas ofrece negociabilidad, pero la estructura principal de la pantalla y sus filtros son rígidos."
        },
        "Valiosa": {
          "puntaje": 4,
          "justificacion": "Proporciona un punto de acceso centralizado para la gestión de 'Datos XM', lo cual es valioso, pero su valor no se realiza completamente hasta que las historias dependientes estén terminadas."
        },
        "Estimable": {
          "puntaje": 3,
          "justificacion": "La estimación es posible para la grilla y los filtros, pero la dependencia de reglas genéricas de otra HU (#9223) y de las acciones en otras HUs introduce incertidumbre."
        },
        "Pequeña": {
          "puntaje": 3,
          "justificacion": "La historia en sí (la pantalla de consulta) es de tamaño mediano, pero funciona como un contenedor para otras funcionalidades, lo que aumenta su alcance percibido."
        },
        "Testeable": {
          "puntaje": 4,
          "justificacion": "Los filtros, las columnas y la presencia de los botones de acción son testeables. Sin embargo, el testeo E2E requiere las otras historias."
        }
      },
      "puntos_historia": 5,
      "dias_trabajo_aproximados": "4-5",
      "complejidad": 3,
      "posibles_mejoras": [
        "Dividir la historia. Una historia para 'Consultar y filtrar Líneas (Datos XM)' y otras para las acciones. Esto mejoraría la independencia y permitiría una entrega de valor incremental.",
        "La HU menciona la 'Creación' en la descripción, pero no se detalla en los criterios de aceptación. Se debe añadir un criterio para el botón 'Crear' o eliminar la mención."
      ],
      "estimacion_dias": 6.3,
      "url": "https://dev.azure.com/XM-Mercado/b98d1df5-c2a4-4241-8000-c179906fa7b7/_workitems/edit/25885"
    },
    {
      "id": 25886,
      "titulo": "FUNC- 25886. Administrar Líneas (Datos CIM)",
      "evaluacion_invest": {
        "Independiente": {
          "puntaje": 1,
          "justificacion": "No es independiente por la misma razón que la HU 25885. Depende de las historias #25889 (Editar) y #25901 (Eliminar) para ser funcional."
        },
        "Negociable": {
          "puntaje": 3,
          "justificacion": "Similar a la HU 25885, la gestión de columnas es negociable, pero el resto de la funcionalidad está predefinida."
        },
        "Valiosa": {
          "puntaje": 4,
          "justificacion": "Valiosa como punto de acceso para la gestión de 'Datos CIM', pero su valor completo depende de otras historias."
        },
        "Estimable": {
          "puntaje": 3,
          "justificacion": "Estimable, pero con la misma incertidumbre que la HU 25885 debido a las dependencias externas (#9223, #25889, #25901)."
        },
        "Pequeña": {
          "puntaje": 3,
          "justificacion": "De tamaño mediano. Podría ser más pequeña si se reutilizan componentes genéricos de la pantalla de 'Datos XM'."
        },
        "Testeable": {
          "puntaje": 4,
          "justificacion": "Los criterios de la consulta son testeables, pero las acciones no se pueden probar de forma aislada."
        }
      },
      "puntos_historia": 5,
      "dias_trabajo_aproximados": "4-5",
      "complejidad": 3,
      "posibles_mejoras": [
        "Considerar unificar las HU 25885 y 25886 en una sola pantalla con pestañas para 'Datos XM' y 'Datos CIM' para reducir la duplicación de esfuerzo y mejorar la consistencia de la UI.",
        "Al igual que la HU 25885, se debe dividir para separar la consulta de las acciones, que son dependencias."
      ],
      "estimacion_dias": 6.3,
      "url": "https://dev.azure.com/XM-Mercado/b98d1df5-c2a4-4241-8000-c179906fa7b7/_workitems/edit/25886"
    },
    {
      "id": 25889,
      "titulo": "FUNC-25889. Crear/Modificar Líneas(Datos CIM)",
      "evaluacion_invest": {
        "Independiente": {
          "puntaje": 2,
          "justificacion": "Tiene una dependencia de datos con la HU #25893 para una regla de validación, lo que acopla las dos historias y dificulta el desarrollo y las pruebas independientes."
        },
        "Negociable": {
          "puntaje": 1,
          "justificacion": "No es negociable. Los criterios de aceptación son una especificación técnica detallada con validaciones muy estrictas para cada campo, dejando cero espacio para la negociación."
        },
        "Valiosa": {
          "puntaje": 5,
          "justificacion": "El valor es muy alto, ya que permite la entrada y actualización de datos técnicos fundamentales para el modelo de red."
        },
        "Estimable": {
          "puntaje": 3,
          "justificacion": "Aunque es muy detallada, la gran cantidad de reglas de validación complejas y condicionales hace que la estimación sea propensa a errores."
        },
        "Pequeña": {
          "puntaje": 1,
          "justificacion": "No es pequeña. Es una historia grande que involucra un formulario con más de 14 campos, cada uno con lógica de validación específica y compleja."
        },
        "Testeable": {
          "puntaje": 5,
          "justificacion": "Es extremadamente testeable. Cada regla de validación definida en los criterios de aceptación se puede convertir directamente en un caso de prueba."
        }
      },
      "puntos_historia": 8,
      "dias_trabajo_aproximados": "7-10",
      "complejidad": 4.5,
      "posibles_mejoras": [
        "Dividir la historia en partes más pequeñas. Por ejemplo: 1) Crear/Modificar Línea con los campos obligatorios para la creación. 2) Añadir validaciones de completitud para los campos restantes.",
        "Reescribir los criterios de aceptación para que sean menos prescriptivos sobre la implementación y se centren en el comportamiento esperado desde la perspectiva del usuario.",
        "Desacoplar la regla de validación que depende de la HU #25893. La lógica de validación debería poder acceder a los datos de 'Tipo de línea' sin depender de otra historia."
      ],
      "estimacion_dias": 9.3,
      "url": "https://dev.azure.com/XM-Mercado/b98d1df5-c2a4-4241-8000-c179906fa7b7/_workitems/edit/25889"
    },
    {
      "id": 25892,
      "titulo": "FUNC-25892. Administrar líneas (Datos Generales)",
      "evaluacion_invest": {
        "Independiente": {
          "puntaje": 1,
          "justificacion": "No es independiente. Es una historia 'contenedora' masiva que depende de múltiples otras HU (#8589) e invoca dinámicamente otros componentes."
        },
        "Negociable": {
          "puntaje": 1,
          "justificacion": "El alcance es enorme y está definido de manera muy rígida, cubriendo filtros, resultados y acciones complejas. No es negociable en su forma actual."
        },
        "Valiosa": {
          "puntaje": 5,
          "justificacion": "El valor potencial es muy alto al crear un centro de administración unificado, pero intenta entregar demasiado valor en un solo paquete."
        },
        "Estimable": {
          "puntaje": 1,
          "justificacion": "Muy difícil de estimar con precisión debido a su tamaño y complejidad. El riesgo de subestimación es extremadamente alto."
        },
        "Pequeña": {
          "puntaje": 1,
          "justificacion": "No es una historia, es un Epic. Su alcance es demasiado grande para ser manejado en un solo sprint."
        },
        "Testeable": {
          "puntaje": 2,
          "justificacion": "Testear esta historia en su totalidad es una tarea masiva. La cantidad de combinaciones de filtros, permisos y tipos de elementos es prohibitiva."
        }
      },
      "puntos_historia": 8,
      "dias_trabajo_aproximados": "15+",
      "complejidad": 5,
      "posibles_mejoras": [
        "Descomponer esta HU en un Epic con múltiples historias de usuario más pequeñas y manejables (ej. una para la estructura base, una por cada filtro, una para la tabla de resultados, etc.).",
        "Completar la descripción de la historia. El propósito ('Para...') está vacío, lo que oculta el objetivo final del usuario.",
        "Priorizar las historias descompuestas para entregar valor de forma incremental, en lugar de intentar construir toda la funcionalidad de una vez."
      ],
      "estimacion_dias": 10.3,
      "url": "https://dev.azure.com/XM-Mercado/b98d1df5-c2a4-4241-8000-c179906fa7b7/_workitems/edit/25892"
    }
  ]
}